MikroElektronika/core_packages/PIC/XC8/def/PIC16C781/mcu.h
extern volatile DACON0bits_t DACON0bits __at(0x11F);
// bitfield macros
#define _DACON0_DARS_POSN                                   0x0
#define _DACON0_DARS_POSITION                               0x0
#define _DACON0_DARS_SIZE                                   0x2
#define _DACON0_DARS_LENGTH                                 0x2
#define _DACON0_DARS_MASK                                   0x3
#define _DACON0_DAOE_POSN                                   0x6
#define _DACON0_DAOE_POSITION                               0x6
#define _DACON0_DAOE_SIZE                                   0x1
#define _DACON0_DAOE_LENGTH                                 0x1
#define _DACON0_DAOE_MASK                                   0x40
#define _DACON0_DAON_POSN                                   0x7
#define _DACON0_DAON_POSITION                               0x7
#define _DACON0_DAON_SIZE                                   0x1
#define _DACON0_DAON_LENGTH                                 0x1
#define _DACON0_DAON_MASK                                   0x80
#define _DACON0_DARS0_POSN                                  0x0
#define _DACON0_DARS0_POSITION                              0x0
#define _DACON0_DARS0_SIZE                                  0x1
#define _DACON0_DARS0_LENGTH                                0x1
#define _DACON0_DARS0_MASK                                  0x1
#define _DACON0_DARS1_POSN                                  0x1
#define _DACON0_DARS1_POSITION                              0x1
#define _DACON0_DARS1_SIZE                                  0x1
#define _DACON0_DARS1_LENGTH                                0x1
#define _DACON0_DARS1_MASK                                  0x2

// Register: PMCON1
#define PMCON1 PMCON1
extern volatile unsigned char           PMCON1              __at(0x18C);
#ifndef _LIB_BUILD
asm("PMCON1 equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
    };
} PMCON1bits_t;
extern volatile PMCON1bits_t PMCON1bits __at(0x18C);
// bitfield macros
#define _PMCON1_RD_POSN                                     0x0
#define _PMCON1_RD_POSITION                                 0x0
#define _PMCON1_RD_SIZE                                     0x1
#define _PMCON1_RD_LENGTH                                   0x1
#define _PMCON1_RD_MASK                                     0x1

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON0<ADCS0>
extern volatile __bit                   ADCS0               __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON0,6)
// ADCON0<ADCS1>
extern volatile __bit                   ADCS1               __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANSEL<ANS0>
extern volatile __bit                   ANS0                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL,0)
// ANSEL<ANS1>
extern volatile __bit                   ANS1                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL,1)
// ANSEL<ANS2>
extern volatile __bit                   ANS2                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL,2)
// ANSEL<ANS3>
extern volatile __bit                   ANS3                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL,3)
// ANSEL<ANS4>
extern volatile __bit                   ANS4                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 ANS4_bit            _BIT_ACCESS(ANSEL,4)
// ANSEL<ANS5>
extern volatile __bit                   ANS5                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 ANS5_bit            _BIT_ACCESS(ANSEL,5)
// ANSEL<ANS6>
extern volatile __bit                   ANS6                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 ANS6_bit            _BIT_ACCESS(ANSEL,6)
// ANSEL<ANS7>
extern volatile __bit                   ANS7                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 ANS7_bit            _BIT_ACCESS(ANSEL,7)
// LVDCON<BGST>
extern volatile __bit                   BGST                __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(LVDCON,5)
// CM1CON0<C1CH0>
extern volatile __bit                   C1CH0               __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1CH1>
extern volatile __bit                   C1CH1               __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON0,1)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x64);	// @ (0xC * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,4)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1R>
extern volatile __bit                   C1R                 __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 C1R_bit             _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,3)
// CM2CON0<C2CH0>
extern volatile __bit                   C2CH0               __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 C2CH0_bit           _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2CH1>
extern volatile __bit                   C2CH1               __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 C2CH1_bit           _BIT_ACCESS(CM2CON0,1)
// PIE1<C2IE>
extern volatile __bit                   C2IE                __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 C2IE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<C2IF>
extern volatile __bit                   C2IF                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 C2IF_bit            _BIT_ACCESS(PIR1,5)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2R>
extern volatile __bit                   C2R                 __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 C2R_bit             _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON1<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON1,0)
// CALCON<CAL>
extern volatile __bit                   CAL                 __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 CAL_bit             _BIT_ACCESS(CALCON,7)
// CALCON<CALERR>
extern volatile __bit                   CALERR              __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 CALERR_bit          _BIT_ACCESS(CALCON,6)
// CALCON<CALREF>
extern volatile __bit                   CALREF              __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 CALREF_bit          _BIT_ACCESS(CALCON,5)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,1)
// OPACON<CMPEN>
extern volatile __bit                   CMPEN               __at(0x8E6);	// @ (0x11C * 8 + 6)
#define                                 CMPEN_bit           _BIT_ACCESS(OPACON,6)
// DAC<DA0>
extern volatile __bit                   DA0                 __at(0x8F0);	// @ (0x11E * 8 + 0)
#define                                 DA0_bit             _BIT_ACCESS(DAC,0)
// DAC<DA1>
extern volatile __bit                   DA1                 __at(0x8F1);	// @ (0x11E * 8 + 1)
#define                                 DA1_bit             _BIT_ACCESS(DAC,1)
// DAC<DA2>
extern volatile __bit                   DA2                 __at(0x8F2);	// @ (0x11E * 8 + 2)
#define                                 DA2_bit             _BIT_ACCESS(DAC,2)
// DAC<DA3>
extern volatile __bit                   DA3                 __at(0x8F3);	// @ (0x11E * 8 + 3)
#define                                 DA3_bit             _BIT_ACCESS(DAC,3)
// DAC<DA4>
extern volatile __bit                   DA4                 __at(0x8F4);	// @ (0x11E * 8 + 4)
#define                                 DA4_bit             _BIT_ACCESS(DAC,4)
// DAC<DA5>
extern volatile __bit                   DA5                 __at(0x8F5);	// @ (0x11E * 8 + 5)
#define                                 DA5_bit             _BIT_ACCESS(DAC,5)
// DAC<DA6>
extern volatile __bit                   DA6                 __at(0x8F6);	// @ (0x11E * 8 + 6)
#define                                 DA6_bit             _BIT_ACCESS(DAC,6)
// DAC<DA7>
extern volatile __bit                   DA7                 __at(0x8F7);	// @ (0x11E * 8 + 7)
#define                                 DA7_bit             _BIT_ACCESS(DAC,7)
// DACON0<DAOE>
extern volatile __bit                   DAOE                __at(0x8FE);	// @ (0x11F * 8 + 6)
#define                                 DAOE_bit            _BIT_ACCESS(DACON0,6)
// DACON0<DAON>
extern volatile __bit                   DAON                __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 DAON_bit            _BIT_ACCESS(DACON0,7)
// DACON0<DARS0>
extern volatile __bit                   DARS0               __at(0x8F8);	// @ (0x11F * 8 + 0)
#define                                 DARS0_bit           _BIT_ACCESS(DACON0,0)
// DACON0<DARS1>
extern volatile __bit                   DARS1               __at(0x8F9);	// @ (0x11F * 8 + 1)
#define                                 DARS1_bit           _BIT_ACCESS(DACON0,1)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// PSMCCON0<DC0>
extern volatile __bit                   DC0                 __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 DC0_bit             _BIT_ACCESS(PSMCCON0,0)
// PSMCCON0<DC1>
extern volatile __bit                   DC1                 __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 DC1_bit             _BIT_ACCESS(PSMCCON0,1)
// OPACON<GBWP>
extern volatile __bit                   GBWP                __at(0x8E0);	// @ (0x11C * 8 + 0)
#define                                 GBWP_bit            _BIT_ACCESS(OPACON,0)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,2)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,2)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,2)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCB<IOCB0>
extern volatile __bit                   IOCB0               __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOCB0_bit           _BIT_ACCESS(IOCB,0)
// IOCB<IOCB1>
extern volatile __bit                   IOCB1               __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOCB1_bit           _BIT_ACCESS(IOCB,1)
// IOCB<IOCB2>
extern volatile __bit                   IOCB2               __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOCB2_bit           _BIT_ACCESS(IOCB,2)
// IOCB<IOCB3>
extern volatile __bit                   IOCB3               __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOCB3_bit           _BIT_ACCESS(IOCB,3)
// IOCB<IOCB4>
extern volatile __bit                   IOCB4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCB4_bit           _BIT_ACCESS(IOCB,4)
// IOCB<IOCB5>
extern volatile __bit                   IOCB5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCB5_bit           _BIT_ACCESS(IOCB,5)
// IOCB<IOCB6>
extern volatile __bit                   IOCB6               __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 IOCB6_bit           _BIT_ACCESS(IOCB,6)
// IOCB<IOCB7>
extern volatile __bit                   IOCB7               __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 IOCB7_bit           _BIT_ACCESS(IOCB,7)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// LVDCON<LV0>
extern volatile __bit                   LV0                 __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 LV0_bit             _BIT_ACCESS(LVDCON,0)
// LVDCON<LV1>
extern volatile __bit                   LV1                 __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 LV1_bit             _BIT_ACCESS(LVDCON,1)
// LVDCON<LV2>
extern volatile __bit                   LV2                 __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 LV2_bit             _BIT_ACCESS(LVDCON,2)
// LVDCON<LV3>
extern volatile __bit                   LV3                 __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 LV3_bit             _BIT_ACCESS(LVDCON,3)
// LVDCON<LVDEN>
extern volatile __bit                   LVDEN               __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 LVDEN_bit           _BIT_ACCESS(LVDCON,4)
// PIE1<LVDIE>
extern volatile __bit                   LVDIE               __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<LVDIF>
extern volatile __bit                   LVDIF               __at(0x67);	// @ (0xC * 8 + 7)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR1,7)
// PSMCCON0<MAXDC0>
extern volatile __bit                   MAXDC0              __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 MAXDC0_bit          _BIT_ACCESS(PSMCCON0,2)
// PSMCCON0<MAXDC1>
extern volatile __bit                   MAXDC1              __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 MAXDC1_bit          _BIT_ACCESS(PSMCCON0,3)
// CM2CON1<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 MC1OUT_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 MC2OUT_bit          _BIT_ACCESS(CM2CON1,6)
// PSMCCON0<MINDC0>
extern volatile __bit                   MINDC0              __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 MINDC0_bit          _BIT_ACCESS(PSMCCON0,4)
// PSMCCON0<MINDC1>
extern volatile __bit                   MINDC1              __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 MINDC1_bit          _BIT_ACCESS(PSMCCON0,5)
// OPACON<OPAON>
extern volatile __bit                   OPAON               __at(0x8E7);	// @ (0x11C * 8 + 7)
#define                                 OPAON_bit           _BIT_ACCESS(OPACON,7)
// PCON<OSCF>
extern volatile __bit                   OSCF                __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 OSCF_bit            _BIT_ACCESS(PCON,3)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OPTION_REG<PS0>
extern volatile __bit                   _PS0                 __at(0x408);	// @ (0x81 * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   _PS1                 __at(0x409);	// @ (0x81 * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   _PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)  // Note: Changed by MikroE
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PSMCCON1<PSM>
extern volatile __bit                   PSM                 __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 PSM_bit             _BIT_ACCESS(PSMCCON1,1)
// PSMCCON1<PWM>
extern volatile __bit                   PWM                 __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 PWM_bit             _BIT_ACCESS(PSMCCON1,1)
// PSMCCON1<PWM_nPSM>
extern volatile __bit                   PWM_nPSM            __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 PWM_nPSM_bit        _BIT_ACCESS(PSMCCON1,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x34);	// @ (0x6 * 8 + 4)
